example-models/twocpt_population/readme.org
* Description
Parameter inference for the two-compartment solved using
numerical integrator =pmx_integrate_ode_group_bdf=.
* Build
** Edit/Add =cmdstan/make/local=
#+BEGIN_SRC sh
  TORSTEN_MPI = 1                                         # flag on torsten's MPI solvers
  -include $(MATH)make/setup_torsten.mk
  CXXFLAGS += $(CXXFLAGS_MPI) -isystem /usr/local/include # path to MPI library's headers
  LDFLAGS += $(LDFLAGS_MPI)
  CC=mpicxx                                               # name of mpi compilers
  CXX=mpicxx
#+END_SRC
** Build in =cmdstan=
#+BEGIN_SRC sh
  make ../example-models/twocpt_population/twocpt_population
#+END_SRC

* Run
#+BEGIN_SRC sh
mpiexec -n 2 twocpt_population sample data file=twocpt_population.data.R init=twocpt_population.init.R
#+END_SRC
* Results
MPI run results with 1, 2, 4, 8 processes, respectively, for a population size 8.
| run      | wall time(s) |
|----------+--------------|
| n_proc=1 |        10791 |
| n_proc=2 |         5282 |
| n_proc=4 |         2847 |
| n_proc=8 |         2971 |
